[{"model": "home.aboutpage", "pk": 1, "fields": {"title": "About page content", "content": "<p>Flatgov is a project of <a href=\"https://demandprogresseducationfund.org/\">Demand Progress Education Fund</a> in partnership with GovTrack.us. Its purpose is to demonstrate how we can use existing information to provide additional context and new insights into the legislative process that are useful for congressional experts.</p>\r\n\r\n<p>Flatgov was built through a human-centered design process intended to surface the needs of different kinds of expert users that interact with legislative information.&nbsp;</p>\r\n\r\n<p>The key insight behind Flatgov is that legislating is an iterative process. Legislation embodies ideas that arise over multiple Congresses and in multiple contexts.&nbsp;</p>\r\n\r\n<p>For example, similar or identical legislation is reintroduced every Congress. How do we identify those identical or similar bills when they reappear?&nbsp;</p>\r\n\r\n<p>In addition, the same legislative idea can be embodied in multiple bills in the same Congress. Sometimes a smaller bill is rolled into larger legislation. How do we know that the larger bill carries legislative ideas that originated in other legislation?</p>\r\n\r\n<p>When we connect identical or similar bills across the same Congress or across multiple Congresses, we gain a greater understanding of the strengths and weaknesses of the legislation, its likely supporters and opponents, and surface the discussion around those legislative ideas.</p>\r\n\r\n<p>For example, if you can connect related legislation, you can gain important insights:</p>\r\n\r\n<ul>\r\n\t<li>Who has supported the legislation in the past and might be willing to support it again?&nbsp;</li>\r\n\t<li>Are the legislation&rsquo;s supporters in a position to help it move through the committee process or in the other chamber?</li>\r\n\t<li>Which committees have considered the legislation and what information was surfacing through their review?&nbsp;</li>\r\n\t<li>What have the legislative support agencies said about the legislation &mdash; whether in Congressional Research Service Reports, Congressional Budget Office reports, or elsewhere?</li>\r\n\t<li>Has the administration weighed in on the legislation and what have they said?</li>\r\n\t<li>Who is responsible for an idea &mdash; and thus deserves credit for it &mdash; that became law through an alternative legislative vehicle?</li>\r\n\t<li>Where is the legislation in the political process and what is likely to happen next?</li>\r\n</ul>\r\n\r\n<p>The work to create Flatgov proceeded along several parallel tracks.</p>\r\n\r\n<ul>\r\n\t<li><strong>We built an engine that allows us to identify identical, similar, and related legislation</strong> based upon the text similarities and also are bootstrapping those relationships identified by the Congressional Research Service.</li>\r\n\t<li><strong>We scraped information from new sources and extracted insights.</strong> For example, we scraped all of the Statements of Administration Policy and identified the bills to which they refer. We also parsed all of the CRS reports to identify when they refer to specific legislation and connected the bills to the reports.</li>\r\n\t<li><strong>We designed our interface to maximize insights provided to its users.</strong> For example, we created a heuristic to sort the list of co-sponsors to identify those most relevant to moving legislation. We also made it easier for staffers to identify members who had supported legislation in the past so they could be prioritized for outreach.</li>\r\n\t<li><span style=\"font-size:16px\"><strong>We made important information downloadable</strong></span> so that users could reuse and enhance the data for their own purposes.</li>\r\n</ul>\r\n\r\n<p>We are publishing the code for Flatgov online for free, without a license, for anyone to use. Our hope is to spur others to repurpose the code for their own uses. We also seek to encourage the Library of Congress to enhance their premier website, Congress.gov, to maximize the value that people can derive from information on their website by putting legislation in the appropriate temporal context and supporting users in their efforts to connect the dots among legislative actions.</p>\r\n\r\n<p>Flatgov was supposed through a one-time grant. There is more work to do, but we hope our work thus far points the way forward.</p>\r\n\r\n<p>&nbsp;</p>", "created_at": "2021-04-30T18:02:02.777Z", "updated_at": "2021-04-30T18:50:24.597Z"}}]